app/controllers/diseases_controller.rb

SELECT `disease`.* FROM `disease`  WHERE (pharmGkbID in ['PA131285571, PA136400566'])
---
    def set_disease
      @disease = Disease.find(params[:id])