app/controllers/genes_controller.rb

  def index
    puts params.inspect
    if params[:query]
      q = "%#{params[:query]}%"
      puts q
      puts Gene.where('name like ?', q).to_sql
      respond_with Gene.where(
        'name like ? or description like ? or uniprotKB like ? or ensemblID like ?', q, q, q, q).first(100)
---
SELECT  `gene`.* FROM `gene`  WHERE (name like '%sex%' or description like '%sex%' or uniprotKB like '%sex%' or ensemblID like '%sex%')  ORDER BY `gene`.`gene_id` ASC LIMIT 100