app/controllers/genes_controller.rb

SELECT `gene`.* FROM `gene`  WHERE (name like '%sex%' or description like '%sex%' or uniprotKB like '%sex%' or ensemblID like '%sex%')
SELECT `genes`.* FROM `genes`
---
  def index
    if params[:drug_id]
      @genes = Drug.find(params[:drug_id]).genes
    elsif params[:disease_id]
      puts '*'*20
      puts params.inspect
      puts '*'*20
      @genes = Disease.find(params[:disease_id]).genes
    else
      @genes = Gene.all